dveltri/PIC18F25K20-NRF/NRF24L01.c
#include "NRF24L01.h"
#ifdef NRF24L01_H_

/*
                              nRF24L01+
                  Single Chip 2.4GHz Transceiver Driver

Arquivo     :  nRF24L01P.C
Programador :  Eduardo Guilherme Brandt                   
Criação     :  17/11/2011 ( V 1.0 )
Modificado  :  02/02/2012
Contato     :  Eduardogbrandt@yahoo.com.br

Histórico   :  Versão 1.0 - 17/11/2011
                  Revision 1.1 - 29/01/2013                             


               
Functions   :
   See nRF24_commandList.c    //Do not include this file. It´s just for reference.
     

Further information:
   Ps:   *Define SPI pins(RF24_CS, SPI_MISO, SPI_MOSI, SPI_CLK)
         and control pins(RF24_CE, RF24_IRQ) for nRF24L01+
         *Define SPI hardware controller stream RF24_SPI, too.
         *SPI must be configured for more than 2Mbps.
         *Software SPI can be too slow for. It can lead to a
         poor system performance if slower than 4Mbps**

   REQUIRES:
            CCS PICC 4.124+,
            uC with SPI
            #device PASS_STRINGS=IN_RAM  directive
            spi_xfer(RF24_SPI, data, bits)      //It has bugs in V4.124(not return read value). Some tricks was made.
           
   Command-set:       
            see nRF24L01.h header file
            ps: For more details, see nRF24L01+ datasheet.

   Config example: See in RF24_default_config() function


   Revision 1.1:  The line below is a way of putting things work with hardware SPI in some CCS C compiller versions with some uCs. For example, with PIC16F876A hardware SPI it was not necessary. With software SPI it is never necessary. **You must comment(disable) every line with the code spi_read2() as the line below** in case the driver not work.

Code:
   //rv = spi_read2();             //It´s necessary due to spi_xfer read bug






Eduardo Guilherme Brandt  17/11/2011   */
//////////////////////////////////////////////////////////////////////////////////////////
//
//
#ifndef RF24_CS
   #ERROR pino RF24_CS nao definido
#endif
#ifndef RF24_CE
   #ERROR pino RF24_CE nao definido
#endif
#ifndef RF24_IRQ
   #ERROR pino RF24_IRQ nao definido
#endif
#ifndef SPI_MISO       
   #ERROR pino SPI_MISO nao definido
#endif
#ifndef SPI_MOSI       
   #ERROR pino SPI_MOSI nao definido
#endif
#ifndef SPI_CLK       
   #ERROR pino SPI_CLK nao definido
#endif
#ifdef RF24_USE_DMA        //nRF24 uses SPI DMA for multiple byte transfers
   #warning Please, check if "spi_dma.c" is included
#endif
/*#ifdef RF24_PERFORMANCE_MODE       //performance mode ON
   #warning RF24 in performance mode. Not all call functions parameters checks are make.
#endif*/
#ifndef RF24_SPI_DISABLE_WARNING
   #warning Initialize RF24_SPI stream for SPI communication with nRF24L01, as below:
   #warning #USE SPI(SPI2, MASTER, BAUD=1000000, MODE=0, BITS=8, MSB_FIRST, STREAM=RF24_SPI) //this will set SPI in 4MHz(maximum for 16MHz Xtal. #Use SPI is a little buggy)
   #warning At V4.124 compiler version, SPI must be SPI2, due to CCS compiler bug
   #warning #define RF24_SPI_DISABLE_WARNING  for disabling nRF24 SPI warning message.
#endif
#ifndef RF24_PWUPDELAY 
   #define  RF24_PWUPDELAY()  delay_ms(2)       //Delay power on nRF24L01+
#endif
#ifndef RF24_CSDELAY   
   #define  RF24_CSDELAY()    delay_us(10)      //em us
#endif
//
//
//
#include <nRF24L01P.h>     //HEADER FILE
//
//
//
/*****************************************************************************************
******************************************************************************************
*************************SPI handshake and I/O commands***********************************
*****************************************************************************************/
/*****************************************************************************************
******************************************************************************************
*************************SPI handshake and I/O commands***********************************
*****************************************************************************************/
/*****************************************************************************************
******************************************************************************************
*************************SPI handshake and I/O commands***********************************
*****************************************************************************************/
/*****************************************************************************************
******************************************************************************************
* DEFINED MACROS
* ex:   
*     RF24_select();    //Controls bit Chipselect
*/
#define RF24_xfer(xdata)   spi_xfer(RF24_SPI, xdata)  //Send/receive data through SPI(controls RF24_CS manualy)___DON´T USE RF24_xfer() ALIAS FOR MORE THAN 1 xdata PARAMETER
#define RF24_select()      output_low(RF24_CS)        //Controls bit Chipselect
#define RF24_unselect()    output_high(RF24_CS)       //Controls bit Chipselect
#define RF24_enable()      output_high(RF24_CE)       //Controls bit Chipenable
#define RF24_disable()     output_low(RF24_CE)        //Controls bit Chipenable
#define RF24_IRQ_state()   !input(RF24_IRQ)           //IsOn when receive or transmit Data IRQ asserted
/*****************************************************************************************
******************************************************************************************
*
* RF24_comm_in : Send command and receive input(variable lenght, or fixed only 1 input byte)
* RF24_comm_out: Send command and send output(variable lenght)
*
* Dependencies:
*     #device PASS_STRINGS=IN_RAM
*
* Parameters:
*
* comm:     command to send(before sending or receiving data)
* datain:   pointer to data array for receiving
* dataout:  pointer to data array for sending
* dataSZ:   data size(number of bytes for receiving into "datain" pointer)
*
* ex:   
*     data=RF24_comm_in(R_REGISTER|CONFIGURATION);          //Read RF24 config register(receive only one byte into data variable)
*     RF24_comm_in(R_REGISTER|RX_ADDR_P0, *address, 3);     //Send command R_REGISTER|RX_ADDR_P0. After that, receives 3 bytes to array(or pointer). You can send strings directly
*     RF24_comm_out(W_REGISTER|TX_ADDR_P0,  *address, 5);   //Writes 5 bytes from pointer address. Please, set RX address too(for shockburst auto acknowledge)
*     RF24_comm_out(W_REGISTER|TX_ADDR_P0, "test", 4);      //Writes 4 ascii bytes from pointer(string "test"). You can put strings directly
*/
int RF24_comm_in(int comm) {     //Send command and receive input(receive only one byte)
   int rv;
   RF24_select();       
   RF24_xfer(comm);              //RF24 Write address/command(see RF24_addr addresses list tabble in .h file)
   rv = RF24_xfer(0);
   rv = spi_read2();             //It´s necessary due to spi_xfer read bug
   RF24_unselect();   
   return rv;                    //Returns read value
}
//
void RF24_comm_in(int comm, char *datain, int dataSZ) {       //Send command and receive input(dataSZ=number of input bytes)(datain=pointer to data for receiving)
   #ifndef RF24_USE_DMA    int i;   #endif
   RF24_select();       
   RF24_xfer(comm);                 //RF24 Write address/command(see RF24_addr addresses list tabble in .h file)
   #ifdef RF24_USE_DMA
      DMA_read(dataSZ, datain);     //Simple DMA Read and start transfer
      DMA_start();                  //Start DMA transfer
      while(DMA_is_busy());         //DMA is working
   #else                            //Programed IO mode(Normal mode)
      for(i=0;i<dataSZ;i++) {
         *(datain+i)=RF24_xfer(0);
         *(datain+i)=spi_read2();   //It´s necessary due to spi_xfer read bug
      }
   #endif     
   RF24_unselect();   
}
//
int RF24_comm_out(int comm, char *dataout, int dataSZ) {       //Send command and send output string(dataSZ=number of bytes to output)(dataout=pointer to data for sending)
   #ifndef RF24_USE_DMA    int i;   #endif
   int rv;                          //rv=return value(SPI read value)
   RF24_select();       
   RF24_xfer(comm);                 //RF24 Write address/command(see RF24_addr addresses list tabble in .h file)
   
   #ifdef RF24_USE_DMA
      DMA_write(dataSZ, dataout);   //Simple DMA Write and start transfer
      DMA_start();                  //Start DMA transfer
      while(DMA_is_busy());         //DMA is working
   #else                            //Programed IO mode(Normal mode)
      for(i=0;i<dataSZ;i++) {
         RF24_xfer(*(dataout+i));
      } 
   #endif
   //rv = RF24_xfer();              //just catch last spi_xfer received byte)
   //rv = spi_read2();              //It´s necessary due to spi_xfer read bug
   RF24_unselect();   
   return rv;                       //Return last read value
}
/*****************************************************************************************
******************************************************************************************
* Send command (1 or 2 bytes), return status value of nRF24L01
*
* parameters:
*     comm, comm1 : Commands to send
*     commDS      : Comm1 datasize in bits(8 to 32 bits, from lsb to msb)
*
* returns  : It only returns nRF24 general STATUS register(see RF24_STATUS enum)
*
* ex:   
*     RF24_comm(W_REGISTER|CONFIGURATION, PWR_UP);       //RF_packet CRC and nRF24L01+ configuration   //1. Set PWR_UP = 1 and PRIM_RX = 0 in the CONFIG register.
*     RF24_comm(W_REGISTER|RX_ADDR_P1, 0xA1A2A4, 24);    //Address of data pipe 1. 5 Bytes maximumlength. (LSByte first). //Address was set as 0xA1A2A4  24bits(3 bytes)
*
*/
int RF24_comm(int comm) {
   int rv;                       //rv=return value(SPI nRF24 status read value)
   RF24_select();       
   rv=RF24_xfer(comm);           //RF24 Write address/command(see RF24_addr addresses list tabble in .h file)
   rv=spi_read2();               //It´s necessary due to spi_xfer read bug
   RF24_unselect();   
   return rv;                    //Return last read value
}
//
int RF24_comm(int comm, int comm1) {
   int rv;                       //rv=return value(SPI nRF24 status read value)
   RF24_select();       
   RF24_xfer(comm);              //RF24 Write address/command(see RF24_addr addresses list tabble in .h file)
   rv=RF24_xfer(comm1);          //Write config.value or command
   rv=spi_read2();               //It´s necessary due to spi_xfer read bug
   RF24_unselect();   
   return rv;                    //Return last read value
}
//
int RF24_comm(int comm, int32 comm1, int commDS) {   //commDS=datasize(1 to 32 bits)
   int rv;                             //rv=return value(SPI nRF24 status read value)
   RF24_select();       
   RF24_xfer(comm);                    //RF24 Write address/command(see RF24_addr addresses list tabble in .h file)
   rv=spi_xfer(RF24_SPI, comm1, commDS);//Write config.value or command(1 to 32 bits of data)___I CANNOT USE RF24_xfer() ALIAS BECAUSE IT NOT ACCEPTS MORE THAN 1 PARAMETER
   rv=spi_read2();                     //It´s necessary due to spi_xfer read bug
   RF24_unselect();   
   return rv;                    //Return last read value
}
/*****************************************************************************************
******************************************************************************************
*************************General Driver commands******************************************
*****************************************************************************************/
/*****************************************************************************************
******************************************************************************************
*************************General Driver commands******************************************
*****************************************************************************************/
/*****************************************************************************************
******************************************************************************************
*************************General Driver commands******************************************
*****************************************************************************************/
/*****************************************************************************************
******************************************************************************************
* DEFINED MACROS
*
*
*/
//General command functions
//ex:    RF24_FIFO_STATUS_TX_REUSE(RF24_FIFO_STATUS());
//
#define  RF24_FLUSH_TX()      RF24_comm(FLUSH_TX)        //Flush TX FIFO, used in TX mode
#define  RF24_FLUSH_RX()      RF24_comm(FLUSH_RX)        //Flush RX FIFO, used in RX mode. Should not be executed during transmission of acknowledge, that is, acknowledge package will not be completed.
#define  RF24_REUSE_TX_PL()   RF24_comm(REUSE_TX_PL)     //(do not check for errors like TX_EMPTY)Reuse last transmitted payload. TX payload reuse is active until W_TX_PAYLOAD or FLUSH TX is executed. TX payload reuse must not be activated or deactivated during package transmission.
#define  RF24_R_RX_PL_WID()   RF24_comm_in(R_RX_PL_WID)  //Read RX payload width for the top R_RX_PAYLOAD in the RX FIFO. Note: Flush RX FIFO if the read value is larger than 32 bytes.
#define  RF24_W_TX_PAYLOAD_NOACK()  RF24_comm(W_TX_PAYLOAD_NOACK)  //Disables AUTOACK on this specific packet
//to be defined in function  #define  RF24_W_ACK_PAYLOAD(xpipe)  RF24_comm(W_ACK_PAYLOAD&(xpipe&0b00000111))
                                                         //bits 0 to 2(value 0 a 5) Used in RX mode. Write Payload to be transmitted together with ACK packet on choosen Pipenumber(0 to 5). (Pipenumber valid in the range from 000 to 101[0d0 a 0d5]). Maximum three ACK packet payloads can be pending. Payloads with same pipenumber are handled using first in - first out principle. Write payload: 1– 32 bytes. A write operation always starts at byte 0.
//Several defined return functions(returns directly into input variable)
#define  RF24_lost_packets()     RF24_comm_in(R_REGISTER|OBSERVE_TX)>>4            //Know how many packets was lost during Transmition(with autoack feature enabled)
#define  RF24_retry_packets()    RF24_comm_in(R_REGISTER|OBSERVE_TX)&0b00001111    //Know how many retrys for transmit data(TX)(with autoack feature enabled)

#define  RF24_RX_power_detector()   RF24_comm_in(R_REGISTER|RX_POWER_DETECTOR)     //Returns 1 if power is over -65dbm

#define  RF24_setup_autoretry(delay,retrys)  RF24_comm(W_REGISTER|SETUP_AUTORETRANSMISSION, (delay&0b11110000)|(retrys&0b00001111))
                                                                        //delay=0to15(250 to 4000us)(delay between retrys, see datasheet), retrys=0to15(How many TX retrys)
//FIFO_STATUS defined functions(read fifo_status before check bits)
//ex:    RF24_FIFO_STATUS_TX_REUSE(RF24_FIFO_STATUS());
//
#define  RF24_FIFO_STATUS()                  RF24_comm_in(R_REGISTER|FIFO_STATUS) //Returns FIFO_STATUS Register
#define  RF24_FIFO_STATUS_TX_REUSE(fstat)    bit_test(fstat, 6)         //(R)make RF24_enable for at least 10µs to Reuse last transmitted payload. TX payload reuse is active until W_TX_PAYLOAD or FLUSH TX is executed. TX_REUSE is set by the SPI command REUSE_TX_PL, and is reset by the SPI commands W_TX_PAYLOAD or FLUSH TX
#define  RF24_FIFO_STATUS_TX_FULL(fstat)     bit_test(fstat, 5)         //(R)TX FIFO buffer full flag
#define  RF24_FIFO_STATUS_TX_EMPTY(fstat)    bit_test(fstat, 4)         //(R)TX FIFO buffer empty
#define  RF24_FIFO_STATUS_RX_FULL(fstat)     bit_test(fstat, 1)         //(R)RX FIFO buffer full flag
#define  RF24_FIFO_STATUS_RX_EMPTY(fstat)    bit_test(fstat, 0)         //(R)RX FIFO buffer empty

//General STATUS register defined functions(read RF24 status[RF24_get_status()] before check bits)
//ex:    RF24_STATUS_clr_IRQs(RF24_get_status());
//
#define  RF24_get_status()    RF24_comm(NOP)    //Get nRF24 STATUS register in a fast way: It sends NO OPERATION command byte while receives STATUS register byte.
//
#define  RF24_STATUS_extract_pipe_number(xstat)       ((xstat&0b00001110)>>1)    //Return received pipe number(0 to 5)
#define  RF24_STATUS_RX_buffer_empty(xstat)           (((xstat&RX_BUFFER_EMPTY)==RX_BUFFER_EMPTY)?true:false)  //return true if RX_buffer_empty
#define  RF24_STATUS_TX_buffer_full(xstat)            bit_test(xstat, 0)         //return true if TX_buffer_full
//
//Before commands below, use RF24_IRQ_state() to check if some interrupt occurred
#define  RF24_STATUS_RX_dataready_IRQ(xstat)          bit_test(xstat, 6)         //return true if buffer_empty
#define  RF24_STATUS_TX_datasent_IRQ(xstat)           bit_test(xstat, 5)         //return true if buffer_empty
#define  RF24_STATUS_MAX_retrys_reached_IRQ(xstat)    bit_test(xstat, 4)         //return true if buffer_empty
//
//IRQs must be cleared through this command.
#define  RF24_STATUS_clr_IRQs(xstat)                  RF24_comm(W_REGISTER|STATUS, xstat)     //clear selected IRQs(in xstat)
                        //RF24_STATUS_clr_IRQs(IRQ_RX_dataready|IRQ_TX_datasent|IRQ_MAX_retransmit);  //select IRQs to be cleared, or
                        //RF24_STATUS_clr_IRQs(IRQ_ALL);       //clear all possible IRQs
//NOT_WORKS  #define  RF24_STATUS_clr_IRQs(xstat)                  RF24_comm(W_REGISTER|STATUS, (xstat&=IRQ_ALL) )     //clear selected IRQs(in xstat)
/*****************************************************************************************
******************************************************************************************
* DEFINED FUNCTIONS
*
*
*/
/*****************************************************************************************
******************************************************************************************
* Inicialize tris ports of uC
* ex:   RF24_initPorts();
*/
void RF24_initPorts() {
   int1 a;
   //Control
   RF24_unselect();   
   RF24_enable();       
   a=input(RF24_IRQ);      //set tris register to input
   //SPI initial states
   a=input(SPI_MISO);      //set tris register to input
   output_low (SPI_MOSI);
   output_low (SPI_CLK);
}
/*****************************************************************************************
******************************************************************************************
* Inicializa configuracao padrao nRF24L01+ (Ititializes default configuration for chip)
* ex:   RF24_defconf();
*/
void RF24_default_config() {  //Ititializes default configuration for chip nRF24L01+

   #ifdef RF24_USE_DMA
      DMA_default_config();   //Sets default DMA configuration
   #endif     

   RF24_disable();     

   RF24_comm(W_REGISTER|CONFIGURATION, EN_CRC|CRC16|PWR_UP);   //RF_packet CRC and nRF24L01+ configuration and initialization
   //RF24_comm(W_REGISTER|CONFIGURATION, CRC16|PWR_UP);   //NO_CRC, RF_packet CRC and nRF24L01+ configuration and initialization
   RF24_PWUPDELAY();

