dveltri/PIC18F25K20-NRF/NRF24L01.c
   RF24_comm(W_REGISTER|EN_AUTOACK, 0b00011111);   //autoack in pipe 0,1,2,3,4 and 5
   //RF24_comm(W_REGISTER|EN_AUTOACK, 0b00000000);   //autoack in pipe 0,1,2,3,4 and 5

   RF24_comm(W_REGISTER|EN_RXPIPES, 0b00000011);   //****enable only pipes 0 and 1(pipes 2 to 5 are not used)

   RF24_comm(W_REGISTER|SETUP_ADDRESSWIDTH, 1);    //addresswidth setting[1 to 3(3 to 5 bytes)]
                                                   //ADDRESSWIDTH = 1 -> it means 3 bytes

   RF24_comm(W_REGISTER|SETUP_AUTORETRANSMISSION,  //[7:4(250 to 4000us) autoretry delay, 3:0(0 to 15)Auto retry times]
      0b00011111);                                 //waitretry 500us   , retry 15times  //ARD=500µs is long enough for any ACK payload length in 1 or 2Mbps mode
   RF24_comm(W_REGISTER|RF_CHANNEL, 0);   //Set RF channel. F0= 2400 + RF_CHANNEL [MHz]. Use 1 channel of space for 250kbps to 1Mbps radios and 2 channels of space between 2Mbps radios.
                                          //RF channel=0(2400MHz)
   RF24_comm(W_REGISTER|RF_SETUP,
      RF_DR_2Mbps|RF_PWR_0dBm);           //Datarate 2Mbps. PowerAmplifier in 0dBm.
   
   RF24_comm(W_REGISTER|STATUS,           //Status Register (In parallel to the SPI command word applied on the MOSI pin, the STATUS register is shifted serially out on the MISO pin)
      IRQ_RX_dataready|IRQ_TX_datasent|IRQ_MAX_retransmit);   //Clear these tree interrupts

   //RF24_comm(W_REGISTER|RX_ADDR_P0,     //Receive address data pipe 0. 5 Bytes maximumlength. (LSByte first)
   //   0xA1A2A300, 32);                  //Address 0xA1A2A3  24bits(3 bytes, the last fourth byte was written as 0x00)
   RF24_comm_out(W_REGISTER|RX_ADDR_P0,   //Receive address data pipe 0. 5 Bytes maximumlength. (LSByte first)
      "0rdda", 5 );                       //Address ascii "addr0"(5 bytes), LSB first. Because of that, it is writed on the contrary.
   RF24_comm_out(W_REGISTER|RX_ADDR_P1,   //Receive address data pipe 1. 5 Bytes maximumlength. (LSByte first)
      "1rdda", 5 );                       //Address ascii "addr1"(5 bytes), LSB first. Because of that, it is writed on the contrary.
   RF24_comm_out(W_REGISTER|RX_ADDR_P2,   //Receive address data pipe 2. 5 Bytes maximumlength. (LSByte first)
      '2', 1);                            //Address ascii "addr2"  (I can change only the LsByte)
   RF24_comm_out(W_REGISTER|RX_ADDR_P3,   //Receive address data pipe 3. 5 Bytes maximumlength. (LSByte first)
      '3', 1);                            //Address ascii "addr3"  (I can change only the LsByte)
   RF24_comm_out(W_REGISTER|RX_ADDR_P4,   //Receive address data pipe 4. 5 Bytes maximumlength. (LSByte first)
      '4', 1);                            //Address ascii "addr4"  (I can change only the LsByte)
   RF24_comm_out(W_REGISTER|RX_ADDR_P5,   //Receive address data pipe 5. 5 Bytes maximumlength. (LSByte first)
      '5', 1);                            //Address ascii "addr5"  (I can change only the LsByte)

   RF24_comm_out(W_REGISTER|TX_ADDR,      //(3 to 5 bytes)Transmit address. Used for a PTX device only.(LSByte first). Set RX_ADDR_P0 equal to this address to handle automatic acknowledge if Enhanced ShockBurst enabled
      "0rdda", 5 );                       //Address ascii "addr0"(5 bytes), LSB first. Because of that, it is writed on the contrary.

   RF24_comm(W_REGISTER|RX_PW_P0, 32);    //(set 1 to 32)RX payload size pipe0 set to 32 bytes
   RF24_comm(W_REGISTER|RX_PW_P1, 32);    //(set 1 to 32)RX payload size pipe1 set to 32 bytes
   RF24_comm(W_REGISTER|RX_PW_P2, 32);    //(set 1 to 32)RX payload size pipe2 set to 32 bytes
   RF24_comm(W_REGISTER|RX_PW_P3, 32);    //(set 1 to 32)RX payload size pipe3 set to 32 bytes
   RF24_comm(W_REGISTER|RX_PW_P4, 32);    //(set 1 to 32)RX payload size pipe4 set to 32 bytes
   RF24_comm(W_REGISTER|RX_PW_P5, 32);    //(set 1 to 32)RX payload size pipe5 set to 32 bytes
                                          //although other pipes(pipe 2 to 5) are not used(see EN_RXPIPES setting)
   RF24_comm(W_REGISTER|EN_DYNAMIC_PAYLOAD,//bits 0 to 5 enables in pipe0 to pipe5
      0b00111111);                        //Dynamic payload Enabled in all pipes(pipe 0 to 5)

   RF24_comm(W_REGISTER|DYN_PAYLOAD_CONFIG,//Enables (DPL)Dynamic payload length feature. Enable to be able to transmit variable data lenght packets(from 1 to 32 data bytes)
      EN_DPL|EN_ACK_PAY|EN_DYN_ACK);       //All DPL functions enabled
   
   RF24_comm(W_REGISTER|FLUSH_RX);        //Delete RX buffer(already transfered to buffer)
   RF24_comm(W_REGISTER|FLUSH_TX);        //Delete TX buffer(already transfered to buffer)
   RF24_STATUS_clr_IRQs(IRQ_ALL);         //clear IRQs

   RF24_disable();       
}//
/*****************************************************************************************
******************************************************************************************
* Constant carrier wave output for testing:
*        (TX is always on transmitting sinc signal)
*
* The output power of a radio is a critical factor for achieving wanted range. Output
* power is also the first test criteria needed to qualify for all telecommunication regulations.
* Datasheet, see last page.
*/
void RF24_waveout_testing(int channel) {    //TX is always on transmitting sinc signal

   RF24_comm(W_REGISTER|CONFIGURATION, //RF_packet CRC and nRF24L01+ configuration
               PWR_UP);                //1. Set PWR_UP = 1 and PRIM_RX = 0 in the CONFIG register.
   RF24_PWUPDELAY();                   //2. Wait 1.5ms PWR_UP->standby.
   
   RF24_comm(W_REGISTER|RF_SETUP,      //3. In the RF register set:  CONT_WAVE = 1. PLL_LOCK = 1. RF_PWR.
               CONT_WAVE|PLL_LOCK|RF_DR_2Mbps|RF_PWR_0dBm);    //Datarate 2Mbps. PowerAmplifier in 0dBm.

   RF24_comm(W_REGISTER|RF_CHANNEL, channel);//4. Set the wanted RF channel. //If RF channel=0(2400MHz)(increases 1MHz per channel)

   RF24_enable();                      //5. Set CE high.
   //                                  //6. Keep CE high as long as the carrier is needed.
}//
/************************************************************************************
* Enhanced ShockBurst transmitting payload:
* Datasheet, see page 75.
*
*
*/
int RF24_TX_SET() {    //Enhanced ShockBurst transmitting payload(return 1 if ok, return other number if error)
int data;
   RF24_disable();                     
   //   
   data=RF24_comm_in(R_REGISTER|CONFIGURATION); //Read RF24 config register
   if ((data&PWR_UP)!=PWR_UP) return 0x02;      //Error: Turn PWR_UP on before transmit
   data&=~PRIM_RX;                              //1. Set the configuration bit PRIM_RX low.
   RF24_comm(W_REGISTER|CONFIGURATION, data);   //rewrite config data with PRIM_RX off(transmitter mode)//RF24_PWUPDELAY();
   
   RF24_enable();                               //3. A high pulse on CE starts the transmission. The minimum pulse width on CE is 10µs.
   delay_us(10);
   RF24_disable();                           
   

