dveltri/PIC18F25K20-NRF/NRF24L01.c
   return true;               //Success
}//
/************************************************************************************
* Receive data(1 to 32 bytes) into buffer:
*
* Parameters:
*
* pipe      //return number of received pipe(0 to 5)
* datasize  //return number of received bytes in RX buffer(1 to 32)
* buffer    //32bytes buffer for received data(can be a pointer or an array)
* returns   //Returns true(1) if data received. False(0) if not
*
*/
int RF24_RX_getbuffer(int *pipe, int *datasize, char *buffer) {   //Receive data(1 to 32 bytes) into buffer
   int i;
   //   
   RF24_enable();                                  //Enables receiver
   if (!RF24_IRQ_state()) return 0;                //No data received(no IRQ set)
   //
   i = RF24_get_status();                          //receive status data in i.
   if (!RF24_STATUS_RX_dataready_IRQ(i)) return 2; //No data received(another IRQ was set)
   //
   *pipe = RF24_STATUS_extract_pipe_number(i);     //Extract received pipe number(0 to 5)
   //
   *datasize = RF24_comm_in(R_RX_PL_WID);          //Read RX payload width for the top R_RX_PAYLOAD in the RX FIFO.
   if (*datasize>32 || *datasize==0) {             //Note: Flush RX FIFO if the read value is larger than 32 bytes.
      RF24_comm(FLUSH_RX);                         //Delete RX buffer
      RF24_STATUS_clr_IRQs(IRQ_RX_dataready);      //clear RX IRQ
      return 3;                                    //RX error
   }
   //
   //hehe
   RF24_STATUS_clr_IRQs(IRQ_RX_dataready);         //clear RX IRQ
   //RF24_STATUS_clr_IRQs(IRQ_ALL);                //clear All irqs
   //Load data from nRF24L01+
   RF24_comm_in(R_RX_PAYLOAD, buffer, *datasize);  //Read RX-payload: 1 – 32 bytes. A read operation always starts at byte 0. Payload is deleted from FIFO after it is read. Used in RX mode.
   return true;                                    //Data received
}//
/************************************************************************************
* Beep if there is RFsignal stronger that -64dB on choosen channel
*
* returns   //Returns true(1) if data received. False(0) if not
*     
*/
#define  buzzer_on()    set_pwm1_duty(61)      //Liga Buzzer
#define  buzzer_off()   set_pwm1_duty(0)        //Desliga Buzzer
int RF24_check_rfsignal() {     //Beep if there is RFsignal stronger that -64dB on choosen channel
   int rfstat=0;
   while(true) {
      RF24_comm_in(R_REGISTER|RX_POWER_DETECTOR, &rfstat, 1);
      if (rfstat==0) {
         buzzer_off(); delay_ms(1);
         return false; }
      else {
         buzzer_on();  delay_ms(1); 
         return true;
      }
   }
}//
/************************************************************************************
* Check actual configuration
* (only for debugging purposes, stop in each delay)
*
*
*/
void RF24_check_config() {      //Check actual configuration(only for debugging purposes, stop in each delay)
   int bbuf[40];
   
   RF24_comm_in(R_REGISTER|CONFIGURATION, bbuf, 1);      //EN_CRC|CRC16|PWR_UP);   //RF_packet CRC and nRF24L01+ configuration and initialization
   delay_ms(10);
     
   RF24_comm_in(R_REGISTER|EN_AUTOACK, bbuf, 1);         //0b00011111);   //autoack in pipe 0,1,2,3,4 and 5
   delay_ms(10);

   RF24_comm_in(R_REGISTER|EN_RXPIPES, bbuf, 1);         //0b00000011);   //****enable only pipes 0 and 1(pipes 2 to 5 are not used)
   delay_ms(10);

   RF24_comm_in(R_REGISTER|SETUP_ADDRESSWIDTH, bbuf, 1);          //, 1);  //addresswidth setting[1 to 3(3 to 5 bytes)]//ADDRESSWIDTH = 1 -> it means 3 bytes
   delay_ms(10);
   RF24_comm_in(R_REGISTER|SETUP_AUTORETRANSMISSION, bbuf, 1);    //[7:4(250 to 4000us) autoretry delay, 3:0(0 to 15)Auto retry times]
                                                                     //0b00011111);    //waitretry 500us   , retry 15times  //ARD=500µs is long enough for any ACK payload length in 1 or 2Mbps mode
   delay_ms(10);

   RF24_comm_in(R_REGISTER|RF_CHANNEL, bbuf, 1);         //, 0);   //Set RF channel. F0= 2400 + RF_CHANNEL [MHz]. Use 1 channel of space for 250kbps to 1Mbps radios and 2 channels of space between 2Mbps radios.//RF channel=0(2400MHz)
   delay_ms(10);
   RF24_comm_in(R_REGISTER|RF_SETUP, bbuf, 1);           //, RF_DR_2Mbps|RF_PWR_0dBm);           //Datarate 2Mbps. PowerAmplifier in 0dBm.
   delay_ms(10);
   
   RF24_comm_in(R_REGISTER|STATUS, bbuf, 1);             //,           //Status Register (In parallel to the SPI command word applied on the MOSI pin, the STATUS register is shifted serially out on the MISO pin)
                                                            //IRQ_RX_dataready|IRQ_TX_datasent|IRQ_MAX_retransmit);   //Clear these tree interrupts
   delay_ms(10);
   
   RF24_comm_in(R_REGISTER|RX_ADDR_P0, bbuf, 5);//PROBLEMA( bbuf=0x00A1A2 )         //,       //Receive address data pipe 0. 5 Bytes maximumlength. (LSByte first)
                                                            //0xA1A2A3, 24);                      //Address 0xA1A2A3  24bits(3 bytes)
   delay_ms(10);
   RF24_comm_in(R_REGISTER|RX_ADDR_P1, bbuf, 5);//PROBLEMA( bbuf=0x00A1A2 )         //,       //Receive address data pipe 1. 5 Bytes maximumlength. (LSByte first)
                                                            //0xA1A2A4, 24);                      //Address 0xA1A2A4  24bits(3 bytes)
   delay_ms(10);

   RF24_comm_in(R_REGISTER|TX_ADDR, bbuf, 5);            //,          //(3 to 5 bytes)Transmit address. Used for a PTX device only.(LSByte first). Set RX_ADDR_P0 equal to this address to handle automatic acknowledge if Enhanced ShockBurst enabled
                                                            //0xA1A2A3, 24); //Address 0xA1A2A3  24bits(3 bytes)
   delay_ms(10);
   
   RF24_comm_in(R_REGISTER|RX_PW_P0, bbuf, 1);     //, 32);    //(set 1 to 32)RX payload size pipe0 set to 32 bytes
   delay_ms(10);
   RF24_comm_in(R_REGISTER|RX_PW_P1, bbuf, 1);     //, 32);    //(set 1 to 32)RX payload size pipe1 set to 32 bytes
   delay_ms(10);

